app/controllers/line_items_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "207281424"]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Thu, 28 Mar 2013 10:15:33 UTC +00:00], ["updated_at", Thu, 28 Mar 2013 10:15:33 UTC +00:00]]
INSERT INTO "line_items" ("cart_id", "created_at", "product_id", "updated_at") VALUES (?, ?, ?, ?)  [["cart_id", 980190963], ["created_at", Thu, 28 Mar 2013 10:15:33 UTC +00:00], ["product_id", 207281424], ["updated_at", Thu, 28 Mar 2013 10:15:33 UTC +00:00]]
---
  def create
    @cart = current_cart
    product = Product.find(params[:product_id])
    @line_item =  @cart.line_items.build(product: product)

    respond_to do |format|
      if @line_item.save